___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 4</p><h1>

# Data Frames

 - ### ``DataFrames`` are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import numpy as np
import pandas as pd

 ## Creating a DataFrame using the ``list``s of data and columns

pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

Two-dimensional, size-mutable, potentially heterogeneous tabular data.

In [2]:
data = [1, 3, 5, 7, 9, 18]
data

[1, 3, 5, 7, 9, 18]

In [3]:
pd.DataFrame(data=data)

    0
0   1
1   3
2   5
3   7
4   9
5  18

In [4]:
pd.Series(data=data)

0     1
1     3
2     5
3     7
4     9
5    18
dtype: int64

In [5]:
pd.DataFrame(data=data, columns=['col_1'])

   col_1
0      1
1      3
2      5
3      7
4      9
5     18

 ## Creating a DataFrame using a ``NumPy Arrays``

In [6]:
m = np.arange(1, 24, 2).reshape(3, 4)
m

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [7]:
df=pd.DataFrame(data=m, columns=['var1','var2','var3','var4'])
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [8]:
df.head(1)

   var1  var2  var3  var4
0     1     3     5     7

In [9]:
df.tail(1)

   var1  var2  var3  var4
2    17    19    21    23

In [10]:
df.sample(2)

   var1  var2  var3  var4
2    17    19    21    23
1     9    11    13    15

In [11]:
df.columns

Index(['var1', 'var2', 'var3', 'var4'], dtype='object')

In [12]:
for i in df.columns:
    print(df[i].sum())

27
33
39
45

In [13]:
df.columns = ['new1', 'new2', 'new3', 'new4']
df

   new1  new2  new3  new4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [14]:
df.index = ['a', 'b', 'c']
df

   new1  new2  new3  new4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [15]:
df.rename(columns = {'new1':'a', 'new2':'b'})

    a   b  new3  new4
a   1   3     5     7
b   9  11    13    15
c  17  19    21    23

In [16]:
df.rename(index = {'a':1, 'b':2})

   new1  new2  new3  new4
1     1     3     5     7
2     9    11    13    15
c    17    19    21    23

 ## Creating a DataFrame using a ``dict``

In [17]:
df

   new1  new2  new3  new4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [18]:
df.shape

(3, 4)

In [19]:
df.shape[1]

4

In [20]:
df.ndim

2

In [21]:
len(df)

3

In [22]:
df.values

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
type(df.values)

numpy.ndarray

In [25]:
s1 = np.random.randint(2,10, size = 4)
s2 = np.random.randint(3,10, size = 4)
s3 = np.random.randint(4,15, size = 4)

In [26]:
my_dict = {'var1':s1, 'var2':s2, 'var3':s3}
my_dict

{'var1': array([3, 9, 7, 7]),
 'var2': array([4, 7, 5, 4]),
 'var3': array([ 9,  5,  7, 12])}

In [27]:
df1 = pd.DataFrame(my_dict)
df1

   var1  var2  var3
0     3     4     9
1     9     7     5
2     7     5     7
3     7     4    12

In [28]:
list(df1.index)

[0, 1, 2, 3]

In [29]:
[i for i in df1.index]

[0, 1, 2, 3]

In [30]:
'var2' in df1

True

### Now, let's examine again the ***idexing, selection*** and ***slicing*** methods and several ***attributes*** using a different DataFrame

In [31]:
from numpy.random import randn

In [32]:
np.random.seed(101)
df3 = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [33]:
df3.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [34]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
type(df3["W"])

pandas.core.series.Series

In [36]:
type(df3[["W"]])

pandas.core.frame.DataFrame

In [37]:
df3[["W"]]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [38]:
df3[["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [39]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df3[["W","Z","Y"]]

          W         Z         Y
A  2.706850  0.503826  0.907969
B  0.651118  0.605965 -0.848077
C -2.018168 -0.589001  0.528813
D  0.188695  0.955057 -0.933237
E  0.190794  0.683509  2.605967

In [41]:
df3["A":"C"]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [42]:
df3["A":"C"]["W"]

A    2.706850
B    0.651118
C   -2.018168
Name: W, dtype: float64

In [43]:
df3["A":"C"][["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001

#### DataFrame Columns are just Series

**Creating a new column:**

In [44]:
df3["T"] = df3["X"] * df3["W"]
df3

          W         X         Y         Z         T
A  2.706850  0.628133  0.907969  0.503826  1.700261
B  0.651118 -0.319318 -0.848077  0.605965 -0.207914
C -2.018168  0.740122  0.528813 -0.589001 -1.493691
D  0.188695 -0.758872 -0.933237  0.955057 -0.143196
E  0.190794  1.978757  2.605967  0.683509  0.377536

In [45]:
df3['new'] = np.nan
df3

          W         X         Y         Z         T  new
A  2.706850  0.628133  0.907969  0.503826  1.700261  NaN
B  0.651118 -0.319318 -0.848077  0.605965 -0.207914  NaN
C -2.018168  0.740122  0.528813 -0.589001 -1.493691  NaN
D  0.188695 -0.758872 -0.933237  0.955057 -0.143196  NaN
E  0.190794  1.978757  2.605967  0.683509  0.377536  NaN

## [Removing Columns & Rows](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-drop.ipynb)

 ### Removing Columns

In [46]:
df3.drop('new', axis=1)

          W         X         Y         Z         T
A  2.706850  0.628133  0.907969  0.503826  1.700261
B  0.651118 -0.319318 -0.848077  0.605965 -0.207914
C -2.018168  0.740122  0.528813 -0.589001 -1.493691
D  0.188695 -0.758872 -0.933237  0.955057 -0.143196
E  0.190794  1.978757  2.605967  0.683509  0.377536

In [47]:
df3

          W         X         Y         Z         T  new
A  2.706850  0.628133  0.907969  0.503826  1.700261  NaN
B  0.651118 -0.319318 -0.848077  0.605965 -0.207914  NaN
C -2.018168  0.740122  0.528813 -0.589001 -1.493691  NaN
D  0.188695 -0.758872 -0.933237  0.955057 -0.143196  NaN
E  0.190794  1.978757  2.605967  0.683509  0.377536  NaN

In [48]:
df3.drop(['new', 'T'], axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df3.drop(columns = ['new', 'T'])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df3

          W         X         Y         Z         T  new
A  2.706850  0.628133  0.907969  0.503826  1.700261  NaN
B  0.651118 -0.319318 -0.848077  0.605965 -0.207914  NaN
C -2.018168  0.740122  0.528813 -0.589001 -1.493691  NaN
D  0.188695 -0.758872 -0.933237  0.955057 -0.143196  NaN
E  0.190794  1.978757  2.605967  0.683509  0.377536  NaN

In [51]:
df3.drop(columns = ['new', 'T'], inplace=True)

In [52]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

 ### Removing rows

In [53]:
df3.drop("C")  # default axis = 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df3.drop(index = ["C"])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df4 = df3.drop(index = ["C"])
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selecting Rows

### First, let's take a quick look at [`.loc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-loc.ipynb) | [`.iloc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-iloc.ipynb)

#### `.loc[]`  allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]`  allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [56]:
m = np.random.randint(1,40, size=(8,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [57]:
df4.iloc[4]

var1    20
var2    36
var3    31
var4    11
Name: 4, dtype: int32

In [58]:
df4.loc[[4]]

   var1  var2  var3  var4
4    20    36    31    11

In [59]:
df4.loc[2:5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23

In [60]:
df4.iloc[2:5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11

In [61]:
df4.index='a b c d e f g h'.split()
df4

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [62]:
df4.loc[2:5]

TypeError: cannot do slice indexing on Index with these indexers [2] of type int

In [ ]:
df4.iloc[2:5]

   var1  var2  var3  var4
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11

In [ ]:
df4

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [ ]:
df4.iloc[3,1]

30

In [ ]:
df4.loc["d","var2"]

30

In [ ]:
df4.loc['d':'g','var3']

d    25
e    31
f     9
g    38
Name: var3, dtype: int32

In [ ]:
df4.loc['d':'g']['var3']

d    25
e    31
f     9
g    38
Name: var3, dtype: int32

In [ ]:
df4.loc['d':'g'][['var3']]

   var3
d    25
e    31
f     9
g    38

In [ ]:
df4.loc['d':'g',['var3']]

   var3
d    25
e    31
f     9
g    38

In [ ]:
df4.iloc[2:5,2]

c    12
d    25
e    31
Name: var3, dtype: int32

In [ ]:
df4.iloc[2:5][["var2"]]

   var2
c    18
d    30
e    36

#### Let's continue to examine `.loc[]` and `.iloc[]` using ``df3`` again

In [ ]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
df3.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
df3.loc[["C"]]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [ ]:
df3.iloc[[2]]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

### Selecting subset of rows and columns

 - ### `.loc[[row labels|names], [column labels|names]]`

 - ### `.iloc[[row index numbers], [column index numbers]]`

In [ ]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3.loc[["C"],["Z"]]

          Z
C -0.589001

In [ ]:
df3.loc[["A","C"],["X","Z"]]

          X         Z
A  0.628133  0.503826
C  0.740122 -0.589001

In [ ]:
df3.iloc[[0,2],[0,3]]

          W         Z
A  2.706850  0.503826
C -2.018168 -0.589001

In [ ]:
df3.iloc[0:2,0:3]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [ ]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3>2

       W      X      Y      Z
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False   True  False

In [ ]:
df3[df3>2]

         W   X         Y   Z
A  2.70685 NaN       NaN NaN
B      NaN NaN       NaN NaN
C      NaN NaN       NaN NaN
D      NaN NaN       NaN NaN
E      NaN NaN  2.605967 NaN

In [ ]:
df3[df3["Z"]>0.5]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3[df3["Z"]>0.5][df3["X"]<0]

<ipython-input-138-e3b955e79f26>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df3[df3["Z"]>0.5][df3["X"]<0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [ ]:
df3[(df3['W']>0) & (df3['Y']<1)] = 0

In [ ]:
df3

          W         X         Y         Z
A  0.000000  0.000000  0.000000  0.000000
B  0.000000  0.000000  0.000000  0.000000
C -2.018168  0.740122  0.528813 -0.589001
D  0.000000  0.000000  0.000000  0.000000
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
np.random.seed(101)
df3 = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### For two conditions you can use **|**  `or`,  **&**   `and` with parenthesis:

### Conditional selection using ``.loc[]`` and ``.iloc[]``

In [ ]:
df3.loc[(df3.X > 0), ["X", "Y"] ]

          X         Y
A  0.628133  0.907969
C  0.740122  0.528813
E  1.978757  2.605967

In [ ]:
df3.loc[((df3.W>1) | (df3.Y<1)), ['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [ ]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3.reset_index(drop=True)

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3.set_index("Z")

                  W         X         Y
Z
 0.503826  2.706850  0.628133  0.907969
 0.605965  0.651118 -0.319318 -0.848077
-0.589001 -2.018168  0.740122  0.528813
 0.955057  0.188695 -0.758872 -0.933237
 0.683509  0.190794  1.978757  2.605967

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [64]:
# Index Levels
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index


hier_index=pd.MultiIndex.from_tuples(multi_index)

df=pd.DataFrame(np.random.randn(9,4), index = hier_index, columns=['A','B','C','D'])
df

             A         B         C         D
M1 1  0.903319  1.543568  3.014676 -0.139170
   2  0.482311  0.977939 -0.344431 -1.785068
   3  0.530949  0.628364  2.283261  0.148912
M2 1  0.536175  0.144883 -0.627879  1.151898
   2  0.259370 -1.186527 -0.673861 -1.555119
   3 -0.566604 -0.790608  0.230762  1.028012
M3 5 -0.888242 -2.141687 -0.976076  1.414672
   6 -1.562469 -0.676467 -1.617897 -1.818591
   7  0.171447  0.377750  1.049934 -0.526008

In [65]:
df.loc['M1']

          A         B         C         D
1  0.903319  1.543568  3.014676 -0.139170
2  0.482311  0.977939 -0.344431 -1.785068
3  0.530949  0.628364  2.283261  0.148912

In [67]:
df.loc['M1'].loc[[2]]

          A         B         C         D
2  0.482311  0.977939 -0.344431 -1.785068

In [68]:
df.index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [69]:
df.index.names

FrozenList([None, None])

In [70]:
df.index.names = ["Group", "Num"]
df

                  A         B         C         D
Group Num
M1    1    0.903319  1.543568  3.014676 -0.139170
      2    0.482311  0.977939 -0.344431 -1.785068
      3    0.530949  0.628364  2.283261  0.148912
M2    1    0.536175  0.144883 -0.627879  1.151898
      2    0.259370 -1.186527 -0.673861 -1.555119
      3   -0.566604 -0.790608  0.230762  1.028012
M3    5   -0.888242 -2.141687 -0.976076  1.414672
      6   -1.562469 -0.676467 -1.617897 -1.818591
      7    0.171447  0.377750  1.049934 -0.526008

### let's take a quick look at the [``.xs()``](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-xs.ipynb)

In [71]:
df.xs("M1")

            A         B         C         D
Num
1    0.903319  1.543568  3.014676 -0.139170
2    0.482311  0.977939 -0.344431 -1.785068
3    0.530949  0.628364  2.283261  0.148912

In [72]:
df.loc["M1"]

            A         B         C         D
Num
1    0.903319  1.543568  3.014676 -0.139170
2    0.482311  0.977939 -0.344431 -1.785068
3    0.530949  0.628364  2.283261  0.148912

In [74]:
df.xs(("M1",2))

A    0.482311
B    0.977939
C   -0.344431
D   -1.785068
Name: (M1, 2), dtype: float64

In [75]:
df.xs(("M1",2), level=[0,1])

                  A         B         C         D
Group Num
M1    2    0.482311  0.977939 -0.344431 -1.785068

In [76]:
df.xs(key=("M1",2), level=["Group","Num"])

                  A         B         C         D
Group Num
M1    2    0.482311  0.977939 -0.344431 -1.785068

In [78]:
# df.loc[2]
# df.xs(2)
df.xs("M1", level=0)

            A         B         C         D
Num
1    0.903319  1.543568  3.014676 -0.139170
2    0.482311  0.977939 -0.344431 -1.785068
3    0.530949  0.628364  2.283261  0.148912

In [79]:
df.xs(5, level=1)

              A         B         C         D
Group
M3    -0.888242 -2.141687 -0.976076  1.414672

In [80]:
df["C"]

Group  Num
M1     1      3.014676
       2     -0.344431
       3      2.283261
M2     1     -0.627879
       2     -0.673861
       3      0.230762
M3     5     -0.976076
       6     -1.617897
       7      1.049934
Name: C, dtype: float64

In [81]:
df.xs("C", axis=1)

Group  Num
M1     1      3.014676
       2     -0.344431
       3      2.283261
M2     1     -0.627879
       2     -0.673861
       3      0.230762
M3     5     -0.976076
       6     -1.617897
       7      1.049934
Name: C, dtype: float64

### Let's learn new functions/attributes/methods on "iris dataset"

In [82]:
import seaborn as sns

In [83]:
df = sns.load_dataset('iris')

In [84]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [87]:
df.shape

(150, 5)

In [88]:
df.sample(5)

     sepal_length  sepal_width  petal_length  petal_width     species
138           6.0          3.0           4.8          1.8   virginica
83            6.0          2.7           5.1          1.6  versicolor
126           6.2          2.8           4.8          1.8   virginica
28            5.2          3.4           1.4          0.2      setosa
135           7.7          3.0           6.1          2.3   virginica

In [89]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [90]:
df.describe().T

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [92]:
df.describe(include="object")

          species
count         150
unique          3
top     virginica
freq           50

In [93]:
df.describe(include="all")

        sepal_length  sepal_width  petal_length  petal_width    species
count     150.000000   150.000000    150.000000   150.000000        150
unique           NaN          NaN           NaN          NaN          3
top              NaN          NaN           NaN          NaN  virginica
freq             NaN          NaN           NaN          NaN         50
mean        5.843333     3.057333      3.758000     1.199333        NaN
std         0.828066     0.435866      1.765298     0.762238        NaN
min         4.300000     2.000000      1.000000     0.100000        NaN
25%         5.100000     2.800000      1.600000     0.300000        NaN
50%         5.800000     3.000000      4.350000     1.300000        NaN
75%         6.400000     3.300000      5.100000     1.800000        NaN
max         7.900000     4.400000      6.900000     2.500000        NaN

In [94]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [95]:
df.corr()[['sepal_length']]

              sepal_length
sepal_length      1.000000
sepal_width      -0.117570
petal_length      0.871754
petal_width       0.817941

In [96]:
df['petal_length'].corr(df['petal_width'])

0.9628654314027963

In [97]:
df['species'].value_counts()

virginica     50
setosa        50
versicolor    50
Name: species, dtype: int64

In [98]:
df['species'].value_counts(dropna=False)

virginica     50
setosa        50
versicolor    50
Name: species, dtype: int64

In [99]:
df['species'].value_counts(dropna=False, normalize=True)

virginica     0.333333
setosa        0.333333
versicolor    0.333333
Name: species, dtype: float64

In [100]:
df.species.nunique()

3

In [101]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [103]:
df.loc[df['species']=="setosa",'sepal_length']

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [104]:
df[(df.sepal_length>4) & (df.sepal_length<5)]

     sepal_length  sepal_width  petal_length  petal_width     species
1             4.9          3.0           1.4          0.2      setosa
2             4.7          3.2           1.3          0.2      setosa
3             4.6          3.1           1.5          0.2      setosa
6             4.6          3.4           1.4          0.3      setosa
8             4.4          2.9           1.4          0.2      setosa
9             4.9          3.1           1.5          0.1      setosa
11            4.8          3.4           1.6          0.2      setosa
12            4.8          3.0           1.4          0.1      setosa
13            4.3          3.0           1.1          0.1      setosa
22            4.6          3.6           1.0          0.2      setosa
24            4.8          3.4           1.9          0.2      setosa
29            4.7          3.2           1.6          0.2      setosa
30            4.8          3.1           1.6          0.2      setosa
34            4.9          3.1           1.5          0.2      setosa
37            4.9          3.6           1.4          0.1      setosa
38            4.4          3.0           1.3          0.2      setosa
41            4.5          2.3           1.3          0.3      setosa
42            4.4          3.2           1.3          0.2      setosa
45            4.8          3.0           1.4          0.3      setosa
47            4.6          3.2           1.4          0.2      setosa
57            4.9          2.4           3.3          1.0  versicolor
106           4.9          2.5           4.5          1.7   virginica

In [105]:
df[(df.species == "virginica") & (df.sepal_length>4)  & (df.sepal_length<5)]

     sepal_length  sepal_width  petal_length  petal_width    species
106           4.9          2.5           4.5          1.7  virginica

In [106]:
df.loc[(df.species == "virginica") & (df.sepal_length>4)  & (df.sepal_length<5)]

     sepal_length  sepal_width  petal_length  petal_width    species
106           4.9          2.5           4.5          1.7  virginica

In [107]:
df.sort_values(by = 'sepal_length', ascending = True)

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

# End of the Session